nc: 1

activation: nn.ReLU(inplace=True)
anchors:
  - [201, 424, 240, 570, 196, 633, 177, 515, 384, 426, 363, 587, 315, 679, 300, 496]
  - [56, 166, 111, 142, 153, 180, 84, 286, 146, 238, 153, 361, 243, 316, 243, 216]
  - [22, 27, 38, 50, 41, 85, 55, 67, 37, 117, 68, 87, 85, 105, 105, 95, 18, 25, 16, 18, 12, 13]

backbone:
  # stage 1
  - [-1, 1, Conv, [16, 5, 2]]  # 0: 输入3通道，输出16通道，卷积核5x5，步幅2
  - [-1, 1, Conv, [32, 3, 2]]  # 1: 输入16通道，输出32通道，卷积核3x3，步幅2
  - [-1, 1, Conv, [64, 3, 2]]  # 2: 输入32通道，输出64通道，卷积核3x3，步幅2
  - [-1, 1, Conv, [64, 3, 1]]  # 3: 输入64通道，输出64通道，卷积核3x3，步幅1
  - [-1, 1, Conv, [64, 3, 1]]  # 4: 输入64通道，输出64通道，卷积核3x3，步幅1
  # stage 2
  - [-1, 1, Conv, [64, 3, 2]]  # 5: 输入64通道，输出64通道，卷积核3x3，步幅2
  - [-1, 1, Conv, [80, 3, 1]]  # 6: 输入64通道，输出80通道，卷积核3x3，步幅1
  - [-1, 1, Conv, [80, 3, 2]]  # 7: 输入80通道，输出80通道，卷积核3x3，步幅2
  # stage 3
  - [-1, 1, Conv, [112, 3, 2]]  # 8: 输入80通道，输出112通道，卷积核3x3，步幅2
  - [-1, 1, Conv, [112, 3, 1]]  # 9: 输入112通道，输出112通道，卷积核3x3，步幅1
  - [-1, 1, Conv, [144, 3, 1]]  # 10: 输入112通道，输出144通道，卷积核3x3，步幅1

head:
  # neck 1
  - [-1, 1, Conv, [144, 3, 2]]  # 11: 输入144通道，输出144通道，卷积核3x3，步幅2
  - [-1, 1, Conv, [160, 3, 1]]  # 12: 输入144通道，输出160通道，卷积核3x3，步幅1
  - [-1, 1, Conv, [192, 3, 1]]  # 13: 输入160通道，输出192通道，卷积核3x3，步幅1
  - [-1, 1, nn.Conv2d, [48, 1, 1]]  # 14: 输入192通道，输出48(anchor 8 * (box + obj + cls))通道，卷积核1x1，步幅1
  # neck 2
  - [-1, 1, ConvUpsample, [64, 2]]  # 15: 输入192通道，输出64通道，卷积核2x2，步幅2
  - [[-1, 10], 1, Concat, [1]]  # 16: 将15和10的输出进行通道维度上的拼接
  - [-1, 1, Conv, [32, 3, 1]]  # 17: 输入(64+112)通道，输出32通道，卷积核3x3，步幅1
  - [-1, 1, Conv, [48, 3, 1]]  # 18: 输入32通道，输出48通道，卷积核3x3，步幅1
  - [-1, 1, Conv, [80, 3, 1]]  # 19: 输入48通道，输出80通道，卷积核3x3，步幅1
  - [-1, 1, Conv, [80, 3, 1]]  # 20: 输入80通道，输出80通道，卷积核3x3，步幅1
  - [-1, 1, Conv, [96, 3, 1]]  # 21: 输入80通道，输出96通道，卷积核3x3，步幅1
  - [-1, 1, nn.Conv2d, [48, 1, 1]]  # 22: 输入96通道，输出48(anchor 8 * (box + obj + cls))通道，卷积核1x1，步幅1
  # neck 3
  - [-1, 1, ConvUpsample, [64, 2]]  # 23: 输入96通道，输出64通道，卷积核2x2，步幅2
  - [[-1, 7], 1, Concat, [1]]  # 24: 将23和7的输出进行通道维度上的拼接
  - [-1, 1, Conv, [64, 3, 1]]  # 25: 输入(64+80)通道，输出64通道，卷积核3x3，步幅1
  - [-1, 1, Conv, [48, 3, 1]]  # 26: 输入64通道，输出48通道，卷积核3x3，步幅1
  - [-1, 1, Conv, [48, 3, 1]]  # 27: 输入48通道，输出48通道，卷积核3x3，步幅1
  - [-1, 1, Conv, [112, 3, 1]]  # 28: 输入112通道，输出112通道，卷积核3x3，步幅1
  - [-1, 1, Conv, [160, 3, 1]]  # 29: 输入112通道，输出160通道，卷积核3x3，步幅1
  - [-1, 1, nn.Conv2d, [66, 1, 1]]  # 30: 输入160通道，输出48(anchor 11 * (box + obj + cls))通道，卷积核1x1，步幅1
  # head
  - [[14, 22, 30], 1, AnchorDetect, [nc, anchors]]  # 31: 输入14、22、30的输出，进行检测，输出通道数为nc，使用定义的anchors
