# Custom anchor-based detector configuration
nc: 1  # number of classes

# Anchor configuration (width, height pairs for each detection layer)
anchors:
  - [10, 13, 16, 30, 33, 23]      # P3/8 - small objects
  - [30, 61, 62, 45, 59, 119]     # P4/16 - medium objects
  - [116, 90, 156, 198, 373, 326] # P5/32 - large objects

backbone:
  # stage 1
  - [-1, 1, ConvBNReLU, [16, 5, 2]]  # 0: 输入3通道，输出16通道，卷积核5x5，步幅2
  - [-1, 1, ConvBNReLU, [32, 3, 2]]  # 1: 输入16通道，输出32通道，卷积核3x3，步幅2
  - [-1, 1, ConvBNReLU, [64, 3, 2]]  # 2: 输入32通道，输出64通道，卷积核3x3，步幅2
  - [-1, 1, ConvBNReLU, [64, 3, 1]]  # 3: 输入64通道，输出64通道，卷积核3x3，步幅1
  - [-1, 1, ConvBNReLU, [64, 3, 1]]  # 4: 输入64通道，输出64通道，卷积核3x3，步幅1
  # stage 2
  - [-1, 1, ConvBNReLU, [64, 3, 2]]  # 5: 输入64通道，输出64通道，卷积核3x3，步幅2
  - [-1, 1, ConvBNReLU, [80, 3, 1]]  # 6: 输入64通道，输出80通道，卷积核3x3，步幅1
  - [-1, 1, ConvBNReLU, [80, 3, 2]]  # 7: 输入80通道，输出80通道，卷积核3x3，步幅2
  # stage 3
  - [-1, 1, ConvBNReLU, [112, 3, 2]]  # 8: 输入80通道，输出112通道，卷积核3x3，步幅2
  - [-1, 1, ConvBNReLU, [112, 3, 1]]  # 9: 输入112通道，输出112通道，卷积核3x3，步幅1
  - [-1, 1, ConvBNReLU, [144, 3, 1]]  # 10: 输入112通道，输出144通道，卷积核3x3，步幅1

head:
  # neck 1 (P5/32)
  - [-1, 1, ConvBNReLU, [144, 3, 2]]  # 11: 输入144通道，输出144通道，卷积核3x3，步幅2
  - [-1, 1, ConvBNReLU, [160, 3, 1]]  # 12: 输入144通道，输出160通道，卷积核3x3，步幅1
  - [-1, 1, ConvBNReLU, [192, 3, 1]]  # 13: 输入160通道，输出192通道，卷积核3x3，步幅1

  # neck 2 (P4/16)
  - [-1, 1, ConvUpsample, [64, 2]]    # 14: 输入192通道，输出64通道，上采样2x
  - [[-1, 10], 1, Concat, [1]]        # 15: 将14和10的输出进行通道维度上的拼接 (64+144=208)
  - [-1, 1, ConvBNReLU, [32, 3, 1]]   # 16: 输入208通道，输出32通道
  - [-1, 1, ConvBNReLU, [48, 3, 1]]   # 17: 输入32通道，输出48通道
  - [-1, 1, ConvBNReLU, [80, 3, 1]]   # 18: 输入48通道，输出80通道
  - [-1, 1, ConvBNReLU, [80, 3, 1]]   # 19: 输入80通道，输出80通道
  - [-1, 1, ConvBNReLU, [96, 3, 1]]   # 20: 输入80通道，输出96通道

  # neck 3 (P3/8)
  - [-1, 1, ConvUpsample, [64, 2]]    # 21: 输入96通道，输出64通道，上采样2x
  - [[-1, 7], 1, Concat, [1]]         # 22: 将21和7的输出进行通道维度上的拼接 (64+80=144)
  - [-1, 1, ConvBNReLU, [64, 3, 1]]   # 23: 输入144通道，输出64通道
  - [-1, 1, ConvBNReLU, [48, 3, 1]]   # 24: 输入64通道，输出48通道
  - [-1, 1, ConvBNReLU, [48, 3, 1]]   # 25: 输入48通道，输出48通道
  - [-1, 1, ConvBNReLU, [112, 3, 1]]  # 26: 输入48通道，输出112通道
  - [-1, 1, ConvBNReLU, [112, 3, 1]]  # 27: 输入112通道，输出112通道
  - [-1, 1, ConvBNReLU, [160, 3, 1]]  # 28: 输入112通道，输出160通道

  # Detection head - Anchor-based
  # Input from: P5=13(192ch), P4=20(96ch), P3=28(160ch)
  - [[13, 20, 28], 1, AnchorDetect, [nc, anchors]]  # 29: Detect(P3, P4, P5)
